#include <stdio.h>
#include <stdlib.h>

void
f(void)
{
    int a[4];
    int * b = malloc(16);
    int * c;
    int i;

    printf("1: a = %p, b = %p, c = %p\n", a, b, c);

    c = a;
    for(i = 0; i < 4; ++i)
        a[i] = 100 + i;
    // 100 101 102 103
    c[0] = 200;
    printf("2: a[0] = %d, a[1] = %d, a[2] = %d, a[3] = %d\n", 
            a[0], a[1], a[2], a[3]);
    // 200 101 102 103

    c[1] = 300;
    *(c + 2) = 301;
    3[c] = 302;

    printf("3: a[0] = %d, a[1] = %d, a[2] = %d, a[3] = %d\n",
            a[0], a[1], a[2], a[3]);
    // 200 300 301 302

    c = c + 1;
    *c = 400;
    printf("4: a[0] = %d, a[1] = %d, a[2] = %d, a[3] = %d\n",
            a[0], a[1], a[2], a[3]);
    // 200 400 301 302

    // c 在 c[1]
    c = (int *)((char*)c + 1);
    *c = 500;
    printf("5: a[0] = %d, a[1] = %d, a[2] = %d, a[3] = %d\n",
        a[0], a[1], a[2], a[3]);
    // 200 1   -12582611 302
    // error 一定注意 字节序，intel 是小端
    //      另外，每个数本来在内存中的存放顺序都是 小端，不要大端小端 混淆
    // 200 15991040 301 302
    // error => 其他数据也是 小端，不要混用

    // 内存
    //      原：200 | 0x90 01 00 00  |  0x2d 01 00 00  |  302
    //      现：200 | 0x90 f4 01 00  |  0x00 01 00 00  |  302
    // 翻译时，也要按照字节序 => 编解码都需要 按照字节序
    // 值       200 | 0x00 01 f4 90  |  0x00 00 01 00  |  302
    //          200 |     128144     |       256       |  302
    b = (int*)a + 1;
    c = (int*) ((char *)a + 1);
    printf("6: a = %p, b = %p, c = %p\n", a, b, c);
    // a    a + 4   a + 1
}

int
main(int ac, char **av)
{
    f();
    return 0;
}